app/services/uf_service.rb

  def self.fetch(year: nil, month: nil, day: nil, flow: nil, fill_db_with_search: nil)
    path = BASE_URL.dup
    path += "/#{year}" if year
    path += "/#{month.to_s.rjust(2, '0')}" if month
    path += "/dias/#{day.to_s.rjust(2, '0')}" if day

    url = URI("#{path}?apikey=#{API_KEY}&formato=json")

    attempts = 0
    begin
      attempts += 1
      response = Net::HTTP.get(url)
      data = JSON.parse(response)

      if fill_db_with_search
        data['UFs'].each do |uf|
          fecha = Date.parse(uf['Fecha'])
          valor = uf['Valor'].to_s.gsub('.', '').gsub(',', '.').to_f

          # Solo crear si no existe
          UfValue.find_or_create_by!(uf_date: fecha) do |record|
---
INSERT INTO "uf_values" ("uf_date", "uf_value", "created_at", "updated_at") VALUES ('2012-05-01', 22592.72, '2025-09-18 01:10:37.134109', '2025-09-18 01:10:37.134109') RETURNING "id"
SELECT "uf_values".* FROM "uf_values" WHERE "uf_values"."uf_date" = '2012-05-01' LIMIT 1