app/controllers/ufs_controller.rb

SELECT "uf_values".* FROM "uf_values" WHERE "uf_values"."uf_date" BETWEEN '2024-09-17' AND '2025-09-17' ORDER BY "uf_values"."uf_date" ASC
---
  def index
    start_date = Date.today - 1.year
    end_date = Date.today

    cache_key = "ufs_#{start_date}_#{end_date}"
    expires_in = (Time.current.end_of_day - Time.current).to_i

    @ufs_data = Rails.cache.fetch(cache_key, expires_in: expires_in) do
      # Verificar qué fechas faltan en la BD
      existing_dates = UfValue.where(uf_date: start_date..end_date).pluck(:uf_date)
      missing_dates = (start_date..end_date).to_a - existing_dates